DataProcessors/омг_РедактированиеДатыЗапрета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_РедактированиеДатыЗапрета</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/омг_ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.омг_ОбъектыЗапретаРедактирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.омг_АдресаЗапретаРедактирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/омг_РедактированиеДатыЗапрета/Forms/РедактированиеДатыЗапрета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПользователиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ОбъектыЗапрета.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки", Неопределено));
		Возврат;
	КонецЕсли;
	
	Элементы.ОбъектыЗапрета.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
		ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
		Элементы.ОбъектыЗапрета.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗапретаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ПользователиЗапретаТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
		ТекущиеДанные = Элементы.ОбъектыЗапрета.ТекущиеДанные;
		ТекущиеДанные.КлючСтроки = ПользователиЗапретаТекущиеДанные.КлючСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПользователей(Команда)
	
	Форма = ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораУпр", 
		Новый Структура("ЗакрыватьПриВыборе", Ложь), ЭтаФорма, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Форма.Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(Знач ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ВыбранноеЗначение = ВыбранноеЗначение[0];
	КонецЕсли;
	
	Если СтрНайти(ИсточникВыбора.ИмяФормы, "Пользователи") > 0
		Или СтрНайти(ИсточникВыбора.ИмяФормы, "ГруппыПользователей") > 0 Тогда
		НайденныеСтроки = ПользователиЗапрета.НайтиСтроки(Новый Структура("Пользователь", ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ПользователиЗапрета.Добавить();
			НоваяСтрока.Пользователь = ВыбранноеЗначение;
			НоваяСтрока.КлючСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	ИначеЕсли СтрНайти(ИсточникВыбора.ИмяФормы, "Организации") > 0
		Или СтрНайти(ИсточникВыбора.ИмяФормы, "Филиалы") > 0 Тогда
		
		ПользователиТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
			
		НайденныеСтроки = ОбъектыЗапрета.НайтиСтроки(Новый Структура("Объект, КлючСтроки", ВыбранноеЗначение, ПользователиТекущиеДанные.КлючСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = ОбъектыЗапрета.Добавить();
			НоваяСтрока.Объект = ВыбранноеЗначение;
			НоваяСтрока.КлючСтроки = ПользователиТекущиеДанные.КлючСтроки;
		КонецЕсли;
		ОбновитьТипыОбъектов(ОбъектыЗапрета);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПередУдалением(Элемент, Отказ)
	
	ПользователиТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
	
	НайденныеСтроки = ОбъектыЗапрета.НайтиСтроки(Новый Структура("КлючСтроки", ПользователиТекущиеДанные.КлючСтроки));
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		ОбъектыЗапрета.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьГруппыПользователей(Команда)
	
	Форма = ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора",
		Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", Ложь, Истина), ЭтаФорма, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗапретаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОрганизации(Команда)

	ПользователиТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
	
	Если ПользователиТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Организации.ФормаВыбора",
		Новый Структура("ЗакрыватьПриВыборе", Ложь), ЭтаФорма, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьКлиники(Команда)

	ПользователиТекущиеДанные = Элементы.Пользователи.ТекущиеДанные;
	
	Если ПользователиТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Филиалы.Форма.ФормаВыбораУпр",
		Новый Структура("ЗакрыватьПриВыборе", Ложь), ЭтаФорма, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТипыОбъектов(ОбъектыЗапрета)
	
	Для Каждого СтрокаТаблицы Из ОбъектыЗапрета Цикл
		СтрокаТаблицы.ТипОбъекта = ТипЗнч(СтрокаТаблицы.Объект);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбъектыЗапретаПриИзменении(Элемент)
	
	ОбновитьТипыОбъектов(ОбъектыЗапрета);
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПользователиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ДатыЗапретаИзменения.Объект КАК Объект,
	               |	омг_ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	               |	омг_ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета
	               |ИЗ
	               |	РегистрСведений.омг_ДатыЗапретаИзменения КАК омг_ДатыЗапретаИзменения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Пользователь,
	               |	Объект,
	               |	ДатаЗапрета
	               |ИТОГИ ПО
	               |	Пользователь
	               |АВТОУПОРЯДОЧИВАНИЕ";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаПользователей = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПользователей.Следующий() Цикл
			СтрокаПользователей  = ПользователиЗапрета.Добавить();
			СтрокаПользователей.Пользователь = ВыборкаПользователей.Пользователь;
			СтрокаПользователей.КлючСтроки = Новый УникальныйИдентификатор;
			
			ВыборкаОбъектов = ВыборкаПользователей.Выбрать();
			Пока ВыборкаОбъектов.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаОбъектов.Объект) Тогда
					СтрокаОбъектов = ОбъектыЗапрета.Добавить();
					СтрокаОбъектов.Объект = ВыборкаОбъектов.Объект;
					СтрокаОбъектов.ДатаЗапрета = ВыборкаОбъектов.ДатаЗапрета;
					СтрокаОбъектов.КлючСтроки = СтрокаПользователей.КлючСтроки;
				Иначе
					СтрокаПользователей.ДатаЗапрета = ВыборкаОбъектов.ДатаЗапрета;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьТипыОбъектов(ОбъектыЗапрета);
	
КонецПроцедуры


&НаСервере
Процедура ПрименитьНаСервере()
	
	
	РегистрыСведений.омг_ДатыЗапретаИзменения.СоздатьНаборЗаписей().Записать();
	
	СтруктураПоиска = Новый Структура("КлючСтроки");
	
	Для Каждого СтрокаПользователей Из ПользователиЗапрета Цикл
		Если ЗначениеЗаполнено(СтрокаПользователей.ДатаЗапрета) Тогда
			Запись = РегистрыСведений.омг_ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			Запись.Пользователь = СтрокаПользователей.Пользователь;
			Запись.ДатаЗапрета = СтрокаПользователей.ДатаЗапрета;
			Запись.Записать();
		КонецЕсли;
		СтруктураПоиска.КлючСтроки = СтрокаПользователей.КлючСтроки;
		НайденныеСтроки = ОбъектыЗапрета.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаОбъектов Из НайденныеСтроки Цикл
			Запись = РегистрыСведений.омг_ДатыЗапретаИзменения.СоздатьМенеджерЗаписи();
			Запись.Пользователь = СтрокаПользователей.Пользователь;
			Запись.Объект = СтрокаОбъектов.Объект;
			Запись.ДатаЗапрета = СтрокаОбъектов.ДатаЗапрета;
			Запись.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Применить(Команда)
	
	ПрименитьНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ПользователиПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОЗакрытии(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	                                                       
	ТекстПредупреждения = "Изменены настройки даты запрета. Не сохраненные изменения будут потеряны.Продолжить?";
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОЗакрытии", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
